---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.RebarFailures.StandardHookBendDiameterTooSmall
source: html/9c4bf26a-7e8f-1a46-70ad-cd17466eebf1.htm
---
# Autodesk.Revit.DB.BuiltInFailures.RebarFailures.StandardHookBendDiameterTooSmall Property

Rebar Standard Hook Bend Diameter is too small.

## Syntax (C#)
```csharp
public static FailureDefinitionId StandardHookBendDiameterTooSmall { get; }
```